---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.NoColumnsJoinedToGridLines
source: html/9a6edf67-aca6-33bc-67da-14becb68fb90.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.NoColumnsJoinedToGridLines Property

No columns are joined to grid lines, or view parameters exclude all columns.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoColumnsJoinedToGridLines { get; }
```